"""
演示正则表达式
"""

# 首先需要导入re模块
# import re

# 匹配
# re.match(正则表达式,要被匹配的字符串)
# data = re.match()
#
# # 提取出里面匹配成功的数据
# data.group()  # data 对象


"""
演示使用
"""
import re

#        正则表达式  要被匹配的字符串
# data = re.match(r'hello','hello.武汉加油')
# print(data)  # 对象创建成功  就意味正则表达式匹配成功
# print(data.group())

# 正则表达式匹配成功

# //  /  转义的效果  r
# 正则表达式匹配不成功的效果  返回一个None,,
a = 'hello'
data = re.match(r'a','python,武汉加油')
print(data)

"""
如果匹配成功  对象
匹配不成功    None
"""


"""
正则表达式
看起来很复杂
只需要了解一个方法 

sql语句
每天去写,,

"""


"""
端午节安康,,,,
 4 5 
星期六,
星期天 下午
2  结课
考试,
"""

"""
进阶班  印象 回过头来复习 最好的
逻辑性的东西
知识点的一个掌握,,,,
单选题 理念 
多选题 
代码题

查文档也是一个能力
知道  才会去 文档  知道有这回事 暂时忘记了怎么使用
"""













