"""
演示匹配多个字符串
"""
import re
# {1,3} 用来规范前一个单位的数量范围
# print(re.match(r"哈利波特\d{1,3}","哈利波特13").group())

# {3} 用来精确前一个单位的数量必须是多少位
# print(re.match(r"\d{11}","13812345687").group())


# ?
# 座机号码: 0731区号-66666666  一个- 可有可无 存在就一个  要不就 不存在
# print(re.match(r"0731-?\d{8}","0731-66668888").group())

# 区号三位数,四位数, -   七位数或者八位数
# print(re.match(r"\d{3,4}-?\d{7,8}","0731-12345678").group())


# *可有可无  存在可以无限
demo_data = """hello,
武汉加油,
湖北加油,
中国加油
"""

print(re.match(r".*",demo_data,re.S).group())





















