"""
循环变量与死循环
"""

# i = 1  # 循环变量,,控制着循环的开始与结束,还控制循环的次数
# while i <= 5:
#     print("跑了%s个圈" % i)
#     # i += 1 循环变量的自增
#     i = i + 1  # 他会随着数量的增加,,达到触发循环停止的条件,,

# print('吃了早餐')
#
# i = 1  # 循环变量,,控制着循环的开始与结束,还控制循环的次数
# while i <= 5:
#     print("跑了%s个圈" % i)
#     # i += 1 循环变量的自增
#     # i = i + 1  # 他会随着数量的增加,,达到触发循环停止的条件,,
#
# # 死循环
# print('去吃午饭')



"""  表面上
A: 你今晚在家嘛

QQ后端服务器:你今晚在家嘛  一直不停的运行 不休息的  死循环的应用
一直都有电 一直都不错,,, 
QQ后端服务器(1)
QQ后端服务器(2)

B: 你今晚在家嘛

"""


























































































