"""
列表的切片
"""

#        0 1 2 3 4 5 6
list1 = [1,2,3,4,5,6,7]

# list1[开始索引:结束索引:步长]
# list1[0:4:]
# print(list1[0:4:])  # range(1,10) 包前不包后,结束位置往前诺一位
# print(list1[0:3:])

# print(list1[2:6:])



#        0 1 2 3 4 5 6
# list1 = [1,2,3,4,5,6,7]

# list1[开始索引:结束索引:步长]  默认步长 1  2  3
# [1, 2, 3, 4, 5, 6]
# [1,    3,    5]
# print(list1[0:6:2])  #

# print(list1[0:6:3])  # [1,4]


#        0 1 2 3 4 5 6
#         -4    -3 -2  -1
# list1 = [1,2,3,4,5,6,7]
#
# print(list1[0:5:])
# print(list1[0:-2:])













































































