"""
演示函数的定义与调用格式二
"""

# def demo(a):  # a = 200
#     """打印出1到指定数字的累加求和结果"""
#     j = 0
#     i = 0
#     while i <= a:  # 200
#         j += i
#         i += 1
#     print(j)
#
# # 100 200  300 400 麻烦 规则 尽量不要去改动他
# demo(10)  # 传递数据的作用
# # 调用函数的时候 随着我们给的数据的不同 而产生不同的结果




# 带有多个参数的函数的定义与调用
# 定义一个函数,,求任意两个数字求和结果,打印出来
# def add2(a,b):  # 形式参数 形参
#     print(a + b)
#
# while True:
#     num1 = int(input('请出入第一个数字:'))
#     num2 = int(input('请出入第二个数字:'))
#
#     add2(num1,num2)  # 实际的数据 实际参数 实参




# 两个形参的函数
# def add2(a,b):  # 形式参数 形参
#     print(a + b)
#
# # 少写了一个实参
# add2(4,5)


def add2(a,b):  # 形式参数 形参
    print(a + b)

# 多写了一个实参
add2(4,5,6)

# 数量一一对应,, 按照位置分配






































































